app/Models/participantes.php

    public function consultarModulos($modulo)
    {
        $consultaStatus = $this->db->table($this->tableModulos)
            ->where($this->campoModulo, $modulo)
            ->select('Status')
            ->get()->getRowArray();
---
SELECT `Status`
FROM `modulos`
WHERE `Modulo` = 'Cupones'

    public function verificarLimiteRegistros()
    {
        $validacionLimite = $this->db->table($this->tableModulos)
            ->where($this->campoModulo, $this->campoRegistro)
            ->select('Limite')
            ->get()->getRow();

        if ($validacionLimite != null) {

            // SE OBTIENE EL LIMITE
            $limite = $validacionLimite->Limite;

            // CONTAR LOS PARTICIPANTES CON STATUS DIFERENTE DE CANCELADO
            $validacionParticipantes = $this->db->table($this->tableParticipantes)
                ->where('StatusPago !=', 'Cancelado')
                ->where('StatusPago !=', '')
                ->countAllResults();
---
SELECT `Limite`
FROM `modulos`
WHERE `Modulo` = 'Registro'
SELECT COUNT(*) AS `numrows`
FROM `participantes`
WHERE `StatusPago` != 'Cancelado'
AND `StatusPago` != ''

    public function agregarParticipante($data)
    {
        $agregar = $this->db->table($this->tableParticipantes)
            ->insert($data);

        return $this->db->insertID();
---
INSERT INTO `participantes` (`Nombre`, `Correo`, `Sexo`, `Telefono`, `TipoPlayera`, `Categoria`, `Cupon`, `Keyfob`, `Edad`, `Fecha`, `TipoPago`) VALUES ('eduardo', 'chivaa.97@gmail.com', 'Masculino', '2229322062', 'Sin Playera', 'Libre', '', '', '27', '2025-04-16 15:40:19', 'Tarjeta')

    public function actualizarRegistro($id, $data)
    {
        $cancelarRegistro = $this->db->table($this->tableParticipantes)
            ->where('Id', $id);
        return $cancelarRegistro->update($data);
---
UPDATE `participantes` SET `IdPago` = 'pi_3REdhOBX9sCWY09W1xETVQbU', `IdOrden` = 'cs_test_a1RWLRzjlu5FfoTgj8URfFgllja5zkfhNNqa0AoWIVR0YYvE3AongcSrDD', `UrlPago` = 'http://localhost/HortensiasActualizado/?StripePasarela_ID={CHECKOUT_SESSION_ID}&idSocio=24', `StatusPago` = 'Pagado', `NumeroParticipante` = 109
WHERE `Id` = '24'

    public function ultimoNumeroParticipante()
    {
        $ultimoParticipante = $this->db->table($this->tableParticipantes)
            ->select('NumeroParticipante')
            ->orderBy('NumeroParticipante', 'DESC')
            ->limit(1)
            ->get()
            ->getRowArray();
---
SELECT `NumeroParticipante`
FROM `participantes`
ORDER BY `NumeroParticipante` DESC
 LIMIT 1

    public function verificarNumeroParticipante($id)
    {
        $validacionNumeroParticipante = $this->db->table($this->tableParticipantes)
            ->where('Id', $id)
            ->select('NumeroParticipante')
            ->get()->getRowArray();
---
SELECT `NumeroParticipante`
FROM `participantes`
WHERE `Id` = '24'

    public function informacionRegistro($id)
    {
        $infoRegistro = $this->db->table($this->tableParticipantes)
        ->where('Id', $id)
        ->get()->getRowArray();
---
SELECT *
FROM `participantes`
WHERE `Id` = '24'